import React from "react";
import FormControl from "@mui/material/FormControl";
import Select from "react-select";

const names = [
  {
    value: "Демография ва меҳнат статистикаси бошқармаси",
    label: "Демография ва меҳнат статистикаси бошқармаси"
  },
  {
    value: "Ижтимоий соҳа ва барқарор ривожланиш статистикаси бошқармаси",
    label: "Ижтимоий соҳа ва барқарор ривожланиш статистикаси бошқармаси"
  },
  {
    value: "Инвеститсиялар ва қурилиш статистикаси бошқармаси",
    label: "Инвеститсиялар ва қурилиш статистикаси бошқармаси"
  },
  {
    value:
      "Ишбилармонлик муҳити кузатувлари, тадбиркорликни ривожлантириш статистикаси бошқармаси",
    label:
      "Ишбилармонлик муҳити кузатувлари, тадбиркорликни ривожлантириш статистикаси бошқармаси"
  },
  {
    value: "Қишлоқ хўжалиги ва экология статистикаси бошқармаси",
    label: "Қишлоқ хўжалиги ва экология статистикаси бошқармаси"
  },
  {
    value: "Нархлар статистикаси бошқармаси",
    label: "Нархлар статистикаси бошқармаси"
  },
  {
    value: "Саноат статистикаси бошқармаси",
    label: "Саноат статистикаси бошқармаси"
  },
  {
    value: "Ташқи иқтисодий фаолият ва савдо статистикаси бошқармаси",
    label: "Ташқи иқтисодий фаолият ва савдо статистикаси бошқармаси"
  },
  {
    value: "Хизматлар соҳаси статистикаси бошқармаси",
    label: "Хизматлар соҳаси статистикаси бошқармаси"
  }
];

export default function MySelect() {
  return (
    <div
      style={{
        position: "relative",
        zIndex: "3"
      }}
    >
      <FormControl sx={{ m: 1, mt: 3, width: "80%" }}>
        <Select options={names} placeholder="Soha Tanlash" />
      </FormControl>
    </div>
  );
}
